[
    {
        "user": "U1HS3ET8Q",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U1HS3ET8Q|alexsv8251> has joined the channel",
        "ts": "1466162592.000102"
    },
    {
        "type": "message",
        "user": "U157TUAH4",
        "text": "<@U150DHUL9>: Привет, Стас! Мне кажется, этот вопрос будет не мне одному интересен. Скажи пожалуйста, какое у тебя распределение способов читать техническую литературу? Те книги, такую прекрасную подборку которых ты разместил в своей серии статей на dou? (например, ~25% времени на компьютере, ~30% на e-reader'e, ~45% в бумажном варианте) Еще, если не сложно, то поделись, пожалуйста, историей своего пути к текущему распределению. (например, что раньше ты недооценивал бумажный вариант или наоборот переоценивал; и свою текущую точку зрения) Я спрашиваю еще и потому, что думаю, стоит ли покупать e-reader с высоким разрешением для этих целей.",
        "ts": "1466165812.000103"
    },
    {
        "type": "message",
        "user": "U17SM7N78",
        "text": "<@U157TUAH4>:  я лично пользуюсь Е-ридером \"Амазон киндл 3\"около 80% времени, удобно в транспорте, куча книг, быстрый переход по закладкам и поиск нужного, Бумага только настольные вещи - справочники 10%, еще 10% комп - но для глаз это хуже всего по ощущениям",
        "edited": {
            "user": "U17SM7N78",
            "ts": "1466171659.000000"
        },
        "ts": "1466170231.000104"
    },
    {
        "type": "message",
        "user": "U154G64BV",
        "text": "<@U157TUAH4>:  в читалке высокое разрешение не нужно, тк вред будет от того, что будешь присматриваться постоянно к мелким элементам, лучше уже экран побольше выбрать. У меня kindle 4 на 6\", далеко не новый, и его разрешения с головой, а диагональ для pdf лучше побольше от 7\" мин",
        "edited": {
            "user": "U154G64BV",
            "ts": "1466171948.000000"
        },
        "ts": "1466171266.000105"
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "У меня был Sony PRS 300.  Так он pdf\/djvu ну очень медлено читал + на 5\" экране плохо было видно.",
        "ts": "1466171510.000106"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "<@U157TUAH4>: Сложно сказать по поводу литературы. Так как я являюсь владельцем платных аккаунтов на Safari Books, Early Access Manning и O'Reilly, то все что я читаю - это либо iPad либо Macbook, но чаще Macbook - потому что я просто так никогда не читаю, каждый пример разбираю. Есть некоторые легендарные вещи которы у меня есть в бумажном варианте (20-30 книг).",
        "ts": "1466174249.000109"
    },
    {
        "type": "message",
        "user": "U17T2T80N",
        "text": "небольшой хинт по ебукам: пдфки удобнее читать в альбомной ориентации ридера",
        "ts": "1466184594.000110"
    },
    {
        "type": "message",
        "user": "U17T2T80N",
        "text": "если вдруг кто не дошёл ещё до этого сам",
        "ts": "1466184613.000111"
    },
    {
        "user": "U1J1ACLDV",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U1J1ACLDV|renat_sapegin> has joined the channel",
        "ts": "1466189536.000112"
    },
    {
        "type": "message",
        "user": "U157TUAH4",
        "text": "спасибо за информацию!",
        "ts": "1466191202.000113"
    },
    {
        "type": "message",
        "user": "U17073E95",
        "text": "мне кажется, что вообще нет разницы, как читать литературу. Важнее в каком порядке.",
        "ts": "1466198105.000114"
    },
    {
        "type": "message",
        "user": "U17073E95",
        "text": "Иначе в некоторых случаях будешь удобно читать китайскую грамоту",
        "ts": "1466198132.000115",
        "reactions": [
            {
                "name": "slightly_smiling_face",
                "users": [
                    "U16UQ8LAZ",
                    "U1CQGH2RJ"
                ],
                "count": 2
            }
        ]
    }
]