[
    {
        "user": "U15A8DXMF",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15A8DXMF|yaroslavhamuha> has joined the channel",
        "ts": "1462172411.000012"
    },
    {
        "user": "U15AGB6HY",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15AGB6HY|0xff> has joined the channel",
        "ts": "1462173192.000013"
    },
    {
        "type": "message",
        "user": "U15AGB6HY",
        "text": "Привет всем.\nМеня Андрей зовут. Имею типичное техническое образование, магистр чего-то там в программировании. Долгое время писал на Delphi и поддерживал сайты на php и всем сопутствующем зоопарке front-end. Сравнительно недавно после продолжительной борьбы с собой и работодателями устроился Java-девелопером. но чувствую опыта мне еще набираться и набираться. Пробовал свои силы в DevOps, но пока что не так много возможностей действительно решать боевые задачи. Смотрю в сторону Scala, недавно проходил курс по MongoDB, узнал много нового, сейчас жду результата финального теста их официальных курсов. Открыт к новым технологиям, готов поучаствовать в чем-нибудь для обучения и знакомства с новыми людьми.",
        "ts": "1462174331.000014"
    },
    {
        "user": "U15AK5F1Q",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15AK5F1Q|ivanfen> has joined the channel",
        "ts": "1462174420.000015"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "welcome <@U15AGB6HY> ",
        "edited": {
            "user": "U150DHUL9",
            "ts": "1462174525.000000"
        },
        "ts": "1462174513.000016"
    },
    {
        "type": "message",
        "user": "U15AGB6HY",
        "text": "Да, отдельное спасибо <@U150DHUL9> за его подборку книг для JavaEE разработчиков. Хотя я еще и в процессе чтения, но начав с многопоточности даже не ожидал, что так много узнаю.\nВ связи именно с этой темой у меня вопрос: часто ли приходится дебажить многопоточный код? И насколько там все больно и сложно?",
        "ts": "1462175024.000018"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Все зависит от проекта. В общем, не часто. Все упирается в базовых вещах по типу работа с Executor’ами, локи разного характера и блокировка ресурсов. Если хочется стать тру multithread engineer - то этому нужно посвящать года. Как правило обычной книги Java Thread Programming хватает чтобы разобраться как все “может” работать.",
        "ts": "1462175250.000019"
    },
    {
        "type": "message",
        "user": "U1577HCQ5",
        "text": "Народ, меня не берут в группу для обучения Java, требуют разговорный английский на среднем уровне.",
        "ts": "1462175363.000020"
    },
    {
        "type": "message",
        "user": "U1577HCQ5",
        "text": "Вопрос: стоит ли учить джаву пока англ не владею (именно разговорным).",
        "ts": "1462175398.000021"
    },
    {
        "type": "message",
        "user": "U1577HCQ5",
        "text": "Аргументируют это тем, что он необходим для первого собеседования на работу",
        "ts": "1462175420.000022"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Можно (а лучше нужно) заниматься и тем и тем параллельно, больше делая упор на английский.",
        "ts": "1462175429.000023"
    },
    {
        "type": "message",
        "user": "U1577HCQ5",
        "text": "вчера прошел курс по  джаве на кодакадеми, он там вообще коротенький. До этого прошел 5 уровней на джавараш. Можете ещё посоветовать что-то ? чтобы именно кодить и задачи решать",
        "ts": "1462175524.000024"
    },
    {
        "type": "message",
        "user": "U15AGB6HY",
        "text": "1. Следующий вопрос, который меня часто волнует: что почитать по архитектуре приложений и в принципе всего окружения приложения? Почему бородатые дядьки выбирают ту или иную БД (если могут это делать, а не приходит приказ сверху), почему выбирают тот или иной фреймворк, помещают app в Docker или запускают на Tomcat? Как разбивают на слои приложение, почему выбирают тот или иной уровень репликации данных? Где об этом можно почитать? Понятно, что ответы на многие вопросы приходят с опытом, но основу же где-то все равно ребята читали.\n2. И вопрос попроще: что почитать именно по архитектуре приложения. На какие слои разбивать приложение, куда какую функциональность выносить. Что можно, например, реализовать прям в контроллере, а что нужно вынести в отдельный класс, когда какой шаблон применять. Эдакие типичные подходы какие-то.",
        "ts": "1462175622.000025"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Если с английским беда, начни с Хортсмана. <@U1577HCQ5>",
        "ts": "1462175632.000026"
    },
    {
        "user": "U15A34E4C",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15A34E4C|danielle777> has joined the channel",
        "ts": "1462175638.000027"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "<@U1552UTDH>: 1. бородатые дядьки, если они профессионалы своего дела, перепробовали и узнали многие фреймворки чтобы сделать выбор на каком то конкретном фреймворке для какого то конкретного проекта. Все индивидуально. Нельзя выбирать стек наобум. 2. Классика жанра Фаулер “Архитектура корпоративных приложений”. А в целом лучше не книги, а опыт ковыряния в различном стеке.",
        "edited": {
            "user": "U150DHUL9",
            "ts": "1462175838.000000"
        },
        "ts": "1462175823.000028"
    },
    {
        "type": "message",
        "user": "U15AGB6HY",
        "text": "<@U150DHUL9>: thanks",
        "ts": "1462176223.000030"
    },
    {
        "user": "U15A9GQBE",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15A9GQBE|tvolosh> has joined the channel",
        "ts": "1462177016.000031"
    },
    {
        "type": "message",
        "user": "U157BASRG",
        "text": "<@U150DHUL9>: прошу меня убрать с команды #4. Не смогу работатть, а столько новых ребят, что просяться в команду. Я не готов так работать. прошу прощения за мой \"+\". Пока готов рассмотреть решения др. Учасников, чтоб перейнять опыт и подходы у решению задач. ",
        "ts": "1462179780.000032"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Что я не вижу этих ребят :)",
        "ts": "1462181830.000033"
    },
    {
        "user": "U15BBD3MG",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15BBD3MG|anatolii.stepaniuk> has joined the channel",
        "ts": "1462182444.000034"
    },
    {
        "user": "U15BKQFA6",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15BKQFA6|anpavlo> has joined the channel",
        "ts": "1462185991.000035"
    },
    {
        "user": "U15BCC547",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15BCC547|dim> has joined the channel",
        "ts": "1462187595.000036"
    },
    {
        "user": "U15B9DZ0T",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15B9DZ0T|belevtsov_sergey> has joined the channel",
        "ts": "1462199998.000037"
    },
    {
        "user": "U15CL8A5A",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15CL8A5A|igornebo> has joined the channel",
        "ts": "1462200922.000038"
    },
    {
        "type": "message",
        "user": "U15CL8A5A",
        "text": "Доброго времени суток. Какая цель этого ресурса? Простое общение  на тему изучения Java?",
        "ts": "1462208390.000039"
    },
    {
        "user": "U15EAFHME",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15EAFHME|zver> has joined the channel",
        "ts": "1462209598.000040"
    },
    {
        "type": "message",
        "user": "U15B9DZ0T",
        "text": "<!everyone>: привет всем. меня зовут Сергей, я из Харькова, java изучаю пол года, считаю цикл статей <@U150DHUL9> лучшими статьями, которые я когда-либо читал по java, за это ему отдельное спасибо. Изучаю основы языка,  предстоить освоить огромное количество технологий но настроен я основательно на получение новых знаний. Очень хочу с вами познакомиться по возможности, найти знакомых для совместого изучения java",
        "ts": "1462210595.000041"
    },
    {
        "type": "message",
        "user": "U15EAFHME",
        "text": "Добрый вечер, меня зовут  Александр, я из Ивано-Франковска. Java  изучаю почти полгода, в основном пользуюсь обучающими роликами на Ютьюб (Yakov Fain, Немчинский, Juja, Технострим <http:\/\/Mail.ru|Mail.ru>, <http:\/\/Stepic.org|Stepic.org>). Прошел курсы MongoDB for Java Developers. Думаю, что пора начать воплощать новые знания в работу над реальным проектом. Надеюсь тут получить необходимый опыт, импульс, волшебный пендаль, чтобы начать прогрессировать. Если почувствую, что уже готов, хотел бы свичнуться с работы на госслужбе в разработку. Интересует тема Big Data. В идеале хотелось бы совместить разработку и Big Data. Как-то так...",
        "ts": "1462211616.000042"
    },
    {
        "type": "message",
        "user": "U15EAFHME",
        "text": "О, очень точно сформулировал вопросы ответы на которые я собираюсь получить здесь <@U15AGB6HY> (<https:\/\/3monthjunior.slack.com\/archives\/general\/p1462175622000025>).",
        "attachments": [
            {
                "color": "4D394B",
                "from_url": "https:\/\/3monthjunior.slack.com\/archives\/general\/p1462175622000025",
                "fallback": "[May 2nd, 2016 12:53 AM] 0xff: 1. Следующий вопрос, который меня часто волнует: что почитать по архитектуре приложений и в принципе всего окружения приложения? Почему бородатые дядьки выбирают ту или иную БД (если могут это делать, а не приходит приказ сверху), почему выбирают тот или иной фреймворк, помещают app в Docker или запускают на Tomcat? Как разбивают на слои приложение, почему выбирают тот или иной уровень репликации данных? Где об этом можно почитать? Понятно, что ответы на многие вопросы приходят с опытом, но основу же где-то все равно ребята читали.\n2. И вопрос попроще: что почитать именно по архитектуре приложения. На какие слои разбивать приложение, куда какую функциональность выносить. Что можно, например, реализовать прям в контроллере, а что нужно вынести в отдельный класс, когда какой шаблон применять. Эдакие типичные подходы какие-то.",
                "author_subname": "0xff",
                "ts": "1462175622.000025",
                "text": "1. Следующий вопрос, который меня часто волнует: что почитать по архитектуре приложений и в принципе всего окружения приложения? Почему бородатые дядьки выбирают ту или иную БД (если могут это делать, а не приходит приказ сверху), почему выбирают тот или иной фреймворк, помещают app в Docker или запускают на Tomcat? Как разбивают на слои приложение, почему выбирают тот или иной уровень репликации данных? Где об этом можно почитать? Понятно, что ответы на многие вопросы приходят с опытом, но основу же где-то все равно ребята читали.\n2. И вопрос попроще: что почитать именно по архитектуре приложения. На какие слои разбивать приложение, куда какую функциональность выносить. Что можно, например, реализовать прям в контроллере, а что нужно вынести в отдельный класс, когда какой шаблон применять. Эдакие типичные подходы какие-то.",
                "author_name": "Andrey A",
                "author_link": "https:\/\/3monthjunior.slack.com\/team\/0xff",
                "author_icon": "https:\/\/avatars.slack-edge.com\/2016-05-02\/39347443253_e53c3aca5191dc1c9778_48.jpg",
                "mrkdwn_in": [
                    "text"
                ],
                "id": 1
            }
        ],
        "ts": "1462212286.000043"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "<@U15EAFHME>: Стас ниже ответил уже - \nlozenko\n10:57 AM <@U1552UTDH>: 1. бородатые дядьки, если они профессионалы своего дела, перепробовали и узнали многие фреймворки чтобы сделать выбор на каком то конкретном фреймворке для какого то конкретного проекта. Все индивидуально. Нельзя выбирать стек наобум. 2. Классика жанра Фаулер “Архитектура корпоративных приложений”. А в целом лучше не книги, а опыт ковыряния в различном стеке. (edited)",
        "ts": "1462212602.000045"
    },
    {
        "type": "message",
        "user": "U155RD230",
        "text": "Добрый вечер меня зовут Александр мне 36 лет, я из Харькова. Заочно закончил университет по специальности КСМ. Вначале пробовал изучать язык С++, но понял что я его не потяну,  вряд ли когда нибудь я смогу освоить Win32 api.  Переключился на изучение языка Java изучал  Java core сам, позже ходил на курсы по Java ЕЕ,  изучение ЕЕ у меня пошло туго . Сейчас восстанавливаю свои знания по Java core чтобы потом опять пытаться изучить Java EE.",
        "ts": "1462212875.000046",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U154201DJ"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U154HT5JM",
        "text": "Ребята - кто -нибудь квест сумел сотворить?",
        "ts": "1462214151.000047"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "<!everyone>: кто успел? :)",
        "ts": "1462214161.000048"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "15 минут и віложим",
        "ts": "1462214333.000049"
    },
    {
        "type": "message",
        "user": "U154HT5JM",
        "text": "Стас - еще такой вопрос. Тут есть некоторые ребята, которые еще не владеют навыками разработки таких приложений - будет ли возможность просмотреть програмный код, чтобы более вникнуть в сам процесс и оформления, и чистоты кода. То есть чтобы подтягивались практические знания у тех, кто только начинает кодить",
        "ts": "1462214347.000050"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "чуть занят был товарищь сделали на скорую руку с одной ветко",
        "ts": "1462214357.000051"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "й",
        "ts": "1462214359.000052"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Скидывайте ссылку на гитхаб ",
        "ts": "1462214372.000053"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "кинем 15 мин",
        "ts": "1462214379.000054"
    },
    {
        "type": "message",
        "user": "U156H597E",
        "text": "У меня так ничего и не получилось.",
        "ts": "1462214624.000055"
    },
    {
        "type": "message",
        "user": "U159WMDMK",
        "text": "Команда #5 <https:\/\/github.com\/koklobok\/QuestGame>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "koklobok\/QuestGame",
                "title_link": "https:\/\/github.com\/koklobok\/QuestGame",
                "text": "Contribute to QuestGame development by creating an account on GitHub.",
                "fallback": "GitHub: koklobok\/QuestGame",
                "thumb_url": "https:\/\/avatars2.githubusercontent.com\/u\/12234199?v=3&s=400",
                "from_url": "https:\/\/github.com\/koklobok\/QuestGame",
                "thumb_width": 420,
                "thumb_height": 420,
                "id": 1
            }
        ],
        "ts": "1462215068.000056"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "<@U154201DJ>: <@U159WMDMK> ревью вашего кода завтра в это же время",
        "ts": "1462215168.000058"
    },
    {
        "type": "message",
        "user": "U150DHUL9",
        "text": "Молодцы",
        "ts": "1462215170.000059"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "Рома красавчик, а я выучил патерн новый",
        "edited": {
            "user": "U154201DJ",
            "ts": "1462216011.000000"
        },
        "ts": "1462215208.000060"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "новый хехе",
        "ts": "1462215215.000061"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "мне очеь повезло с напарником, целый день потратил я, он меньше (ибо знаний побольше) но много чего нового узнал",
        "edited": {
            "user": "U154201DJ",
            "ts": "1462215307.000000"
        },
        "ts": "1462215258.000062"
    },
    {
        "type": "message",
        "user": "U159WMDMK",
        "text": "Женя, ты значительно приувеличиваешь  :simple_smile: \nХотели сделать переход по диалогу с использованием конечного автомата, получился нам понятный код, не знаю как со стороны",
        "ts": "1462215547.000065",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U154201DJ"
                ],
                "count": 1
            }
        ]
    },
    {
        "user": "U15FUV2US",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15FUV2US|tm86> has joined the channel",
        "ts": "1462216218.000067"
    },
    {
        "type": "message",
        "user": "U156DP6FN",
        "text": "<@U154201DJ>: а как патерн называется?",
        "ts": "1462216981.000068"
    },
    {
        "type": "message",
        "user": "U154201DJ",
        "text": "<@U156DP6FN>: state (состояние)",
        "edited": {
            "user": "U154201DJ",
            "ts": "1462217236.000000"
        },
        "ts": "1462217207.000069"
    },
    {
        "user": "U15G85DQX",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15G85DQX|sergiiko> has joined the channel",
        "ts": "1462220615.000071"
    },
    {
        "user": "U15GCRBM4",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15GCRBM4|tanua> has joined the channel",
        "ts": "1462222903.000072"
    },
    {
        "type": "message",
        "user": "U1541UWDC",
        "text": "<!everyone>: Hello everyone! #sleepless Заканчиваю \"специалиста\" в КПИ по направлению Computer Scince. Желание стать java developer'ом появилось ровно год назад, когда проходил преддипломную (на бакалавра) практику в Luxoft, где говорили о большой востребованности java senior'ов.\n\nК сожалению, программированием более чем в рамках учебной программы до получения диплома не занимался, не мог определиться где и кем хочу работать. Пробовал SEO, занимался дизайном, нравится gameDev, решил что должен стать developer'ом. Однозначно! :grinning:\n\nВ конце прошлого лета начал знакомится с java, 5 уровней на javarush, начало Эккля\/Шилда\/Хортсмана, все в перемешку: собеседование в интернатуру NetCracker - не прошел :pensive:\n\nОсенью участвовал в разработке игры в комманде под android, но как дизайнер, т.к. в команде был опытный разработчик. Писали на Unity, так что скилы java я никак не прокачал :slightly_frowning_face:\n\nПозже открыл для себя канал \"Java байки\", посмотрел первый живой стрим, где был Дима и Стас. Тогда Стас как раз набирал людей для менторства - завис на тестовом таске :confused:\n\nПонял, что проблемы в понимании ООП и незакрепленном на пратике синтаксисе, начал читать Гради Буча. Сейчас учавствую developer'ом в игровом проекте на Unity. Пишем 2D roguelike RPG. Пока в разработке слабоват, так что с помошью тимлида пилю спелы. Разбираюсь в движке и  шарпе, что иногда путает. Например, вчера узнал о get\/set properties в c#, чего нет в java.",
        "edited": {
            "user": "U1541UWDC",
            "ts": "1462242115.000000"
        },
        "ts": "1462240048.000073"
    },
    {
        "user": "U15K568J1",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U15K568J1|zadyra> has joined the channel",
        "ts": "1462254691.000077"
    },
    {
        "type": "message",
        "user": "U15K568J1",
        "text": "Всем привет. Я тут не учиться, а по возможности помогать. Уже полтора года программирую на Java only Enterprise приложения. Достаточно хорошо знаю Spring Boot, Spring Security,  Spring JDBC, Spring DataJPA, Spring DataMongoDB и ещё многое по Спринг. Правда уже 7 месяцев Spring не используем. Конечно же Hibernate тоже знаю. AngularJS...\nСейчас пишем проект (модуль) который будет интегрирован с уже существующими модулями, написанными Индусами ещё лет 10 назад :smiley: Используем Jboss EAP 6.4,  стараемся использовать его реализацию j2ee в нашем проекте, почти все зависимости с scope - provided.\nВысшего нету.\nАнгл ниже среднего. на момент трудоустройства вообще был школьный лвл. Сейчас работаю над этим, ведь все пути закрыты без него.\nЛень писать больше) Думаю в процессе общения мы узнаем друг о друге по-больше.",
        "edited": {
            "user": "U15K568J1",
            "ts": "1462292380.000000"
        },
        "ts": "1462256674.000078",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U154201DJ",
                    "U157BASRG",
                    "U155T6S03"
                ],
                "count": 3
            }
        ]
    }
]