[
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "JDBС \nЕсть простейшая ситуация: клас Student и класс Group. Student содержит поле с типом Group.\nХочу вручную потренироваться в JDBС перед изучением ORM. Как связать это все в SQL? Что будет внешним ключем? Первое, что \n\nприходит на ум, это добавить в классе Group поля groupId и static maxGroupID (для инкремента в новом экземляре), а в самой \n\nтаблице Studen в SQL добавить поле groupId. Может, есть более элегантное решение?",
        "ts": "1467550695.000120"
    },
    {
        "user": "U19QTLV5J",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U19QTLV5J|sergokrupski> has joined the channel",
        "ts": "1467551310.000121"
    },
    {
        "type": "message",
        "user": "U16UQ8LAZ",
        "text": "&gt;static maxGroupID (для инкремента в новом экземляре)\n?",
        "ts": "1467551376.000122"
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "типа фиксировать последний Id и при создании нового инстанса присваивать ему Id = ++maxGroupID .",
        "ts": "1467552484.000123"
    },
    {
        "type": "message",
        "user": "U16UQ8LAZ",
        "text": "бд сама увеличивает",
        "ts": "1467552525.000124"
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "так в том то и задумываюсь: вот создал 50 студентов и 5 групп. распределил студентов по группам и хочу записать в базу. как будет отображаться эта связь в базе данных?",
        "ts": "1467552640.000125"
    },
    {
        "type": "message",
        "user": "U16UQ8LAZ",
        "text": "я бы наверно сделал три таблицы\nстудент\nгруппа\nи что нибудь вроде student_groups со \nstudent_id и group_id\n\nно точно не знаю.",
        "ts": "1467552752.000126"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "В бд нужны две таблицы, группа и студент. В таблице \"студент\" - колонка \"ID группы\" и указать, что она - внешний ключ, ссылающийся на колонку ID в таблице \"группа\".",
        "ts": "1467554477.000127",
        "reactions": [
            {
                "name": "heavy_plus_sign",
                "users": [
                    "U16UQ8LAZ"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U16UQ8LAZ",
        "text": "если студент в нескольких группах будут просто дополнительные записи с другим ID группы?",
        "ts": "1467554521.000128"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "Если студент может быть в нескольких группах - тогда ты все верно указал, нужна третья таблица, это уже many to many",
        "edited": {
            "user": "U154C66NP",
            "ts": "1467554917.000000"
        },
        "ts": "1467554571.000129",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U16UQ8LAZ"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "спасибо, nick. Это точно без  ORM? Я хочу попрактиковаться чистым JDBC.",
        "ts": "1467554897.000130"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "Это простое проектирование бд) Как ты будешь осуществлять сохранение данных в эти таблицы - это уже другой вопрос, можешь подключить ORM, а можешь чистым JDBC.",
        "ts": "1467555027.000132"
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "меня больше интересовал вопрос, как формировать поле ID группы в новом экземпляре группы. Ведь на момент добавления студента  в SQL в группе уже должен быть определен IDгруппы, тогда мы сможем взять  Group.getId() и поместить его в GroupId таблицы Student, иначе его нужно будет искать по имени группы или как-то еще. Как, интересно, хибернейт решает этот вопрос?  кстати, ты же вроде сравнительно недавно устроился джуном. Как ощущения?",
        "ts": "1467555868.000133"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "Если группа новая - то мы, по-хорошему, никак не должны формировать её id - это заботы не java-программы, а бд. Если группа уже существует - то да, нужно вытащить её из бд. В orm всё решается элегантно и гораздо проще для понимания. В класс Student добавляется поле Group group с аннотацией ManyToOne и указанием внешнего ключа(JoinColumn name=\"group_id\"). Перед сохранением студента в бд делаешь setGroup(Group group). Ну, и всё на этом)",
        "ts": "1467557423.000134"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "Ощущения самые хорошие, команда маленькая, но все ребята адекватные, приняли отлично. Проекты связаны в основном с одной большой копроративной системой, поэтому помимо java  параллельно получается прокачивать скил js (он там в бэкенде тоже используется, такое вот извращение). Испытательный срок прошел нормально, уже полноценный член команды. От момента первого прихода в офис к моменту допуска к коммерческому проекту прошло чуть больше месяца.",
        "edited": {
            "user": "U154C66NP",
            "ts": "1467557735.000000"
        },
        "ts": "1467557655.000135"
    },
    {
        "type": "message",
        "user": "U172MPHTK",
        "text": "Поздравляю. но помня твое резюме, не удивлен, что у тебя все ок! :slightly_smiling_face:",
        "ts": "1467560073.000137",
        "reactions": [
            {
                "name": "blush",
                "users": [
                    "U154C66NP"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U185K50H1",
        "text": "Если не сложно, опиши свой путь в 2-х словах...  сколько времени ушло, что за чем учил, какими способами (курсы\/сам\/пр),  можь база была какая..... А то шо-то ручки опускаются)",
        "ts": "1467567399.000138"
    },
    {
        "user": "U1NEQAQAC",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U1NEQAQAC|dima> has joined the channel",
        "ts": "1467570548.000139"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "<@U185K50H1>:  база была минимальная. У меня нет технического образования) Но так сложилось, что после окончания гуманитарного факультета я долгое время работал вебмастером\/эникейщиком с вордпрессом. Потихоньку заинтересовался java. Вначале изучал самостоятельно, потом стал ориентироваться на статьи Стаса на dou. Потом мне немножко повезло - одноклассник (senior java developer), узнав что я хочу свичнутся, начал допускать меня в свои фриланс-проекты(в основном доверяли только читать код, правда))). В феврале оставил работу со всеми старыми проектами вне java и сосредоточился на изучении java, т. к. сочетать  работу с активным изучением EE-технологий было просто нереально. В конце марта начал искать работу как java junior. После где-то сотни проигнорированных резюме руки таки начали опускаться. Но в мае таки получил приглашение на собес., после которого получил оффер. От первого знакомства с java до трудоустройства прошёл год.",
        "ts": "1467609734.000140"
    },
    {
        "type": "message",
        "user": "U16K115QT",
        "text": "&gt;Хочу вручную потренироваться в JDBС перед изучением ORM. Как связать это все в SQL?\nДумаю лучше сначала с SQL потренероваться. Без него никуда, от слова \"вообще\".",
        "ts": "1467609737.000141",
        "reactions": [
            {
                "name": "heavy_plus_sign",
                "users": [
                    "U154C66NP"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U16K115QT",
        "text": "&gt;От момента первого прихода в офис к моменту допуска к коммерческому проекту прошло чуть больше месяца.\nЧем месяц занимался? Вникал в структуру?",
        "ts": "1467609891.000142"
    },
    {
        "type": "message",
        "user": "U154C66NP",
        "text": "Изучал API системы, с которой мы работаем, потом выполнял несколько учебных заданий. Последнее так и не доделал, т. к. на одном из \"боевых\" проектов понадобился ещё один dev и меня перебросили на этот проект. К слову, всё произошло ровно так, как рассказывал Немчинский в одном из последних видео)",
        "ts": "1467610590.000143"
    },
    {
        "type": "message",
        "user": "U16K115QT",
        "text": "<http:\/\/rabota.ua\/company209907\/vacancy6236417>",
        "attachments": [
            {
                "service_name": "Rabota.ua. Все вакансии — на одном портале",
                "title": "Junior Java Team Lead for TechFinancials, Kiev, Ciklum",
                "title_link": "http:\/\/rabota.ua\/company209907\/vacancy6236417",
                "text": "On behalf of TechFinancials (<http:\/\/techfinancials.com\/>), Ciklum is looking for a Junior Java Team Lead to join Kiev team on full-time basis. TechFinancials developers touch all layers of the application from the database to the UI. The product is built around technologies such as Spring, Hibernat...",
                "fallback": "Rabota.ua. Все вакансии — на одном портале: Junior Java Team Lead for TechFinancials, Kiev, Ciklum",
                "image_url": "http:\/\/img1.rabota.com.ua\/static\/2015\/05\/vacancy_ru.jpg",
                "ts": 1467382023,
                "from_url": "http:\/\/rabota.ua\/company209907\/vacancy6236417",
                "image_width": 478,
                "image_height": 250,
                "image_bytes": 180144,
                "service_icon": "http:\/\/rabota.ua\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1467611024.000144"
    },
    {
        "type": "message",
        "user": "U16K115QT",
        "text": "Джун тимлид :slightly_smiling_face:",
        "ts": "1467611038.000146",
        "reactions": [
            {
                "name": "grin",
                "users": [
                    "U16UQ8LAZ"
                ],
                "count": 1
            },
            {
                "name": "joy",
                "users": [
                    "U15G85DQX"
                ],
                "count": 1
            }
        ]
    }
]